# Data Investigation with Pandas Assignment

## 1.0 Importing our Libraries

In [1]:
# Importing the libraries we will need

# Importing the pandas library
import pandas as pd

# Importing the numpy library
import numpy as np
from sklearn.impute import KNNImputer

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.

In [2]:
# Let's read the data from the CSV file and create the dataframe to be used
data=pd.read_csv("Rural_Urban_Population_By_Age_Sex_and_by_District__2009 (1).csv")

## 1.2 Previewing our Dataset

In [3]:
# Let's preview the first 10 rows of our data
data.head(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4
5,NAIROBI WEST,Urban,5,7547,7660,15207,Nairobi,NAIROBI,5
6,NAIROBI WEST,Urban,6,6966,7082,14048,Nairobi,NAIROBI,6
7,NAIROBI WEST,Urban,7,6511,6674,13185,Nairobi,NAIROBI,7
8,NAIROBI WEST,Urban,8,6171,6489,12660,Nairobi,NAIROBI,8
9,NAIROBI WEST,Urban,9,6361,6662,13023,Nairobi,NAIROBI,9

## 1.3 Accessing Information about our Dataset

In [5]:
# We can get to know more about the dataset by accessing its information
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  object
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

In [11]:
data.dtypes

District       object
Urban/Rural    object
Age_years      object
Male            int64
Female          int64
Total           int64
County         object
Province       object
OBJECTID        int64
dtype: object

In [6]:
data.isna().sum()

District       0
Urban/Rural    0
Age_years      0
Male           0
Female         0
Total          0
County         0
Province       0
OBJECTID       0
dtype: int64

In [9]:
data.Age_years.value_counts()

Age_years
0         310
61        310
59        310
58        310
57        310
         ...
26        310
25        310
24        310
23        310
Age NS    310
Name: count, Length: 82, dtype: int64

In [10]:
data.Age_years.unique

<bound method Series.unique of 0             0
1             1
2             2
3             3
4             4
          ...
25415        77
25416        78
25417        79
25418       80+
25419    Age NS
Name: Age_years, Length: 25420, dtype: object>

In [15]:
data['Age_years']=pd.to_numeric(data['Age_years'],errors="coerce")
data.dtypes

District        object
Urban/Rural     object
Age_years      float64
Male             int64
Female           int64
Total            int64
County          object
Province        object
OBJECTID         int64
dtype: object

In [16]:
data.Age_years.unique

<bound method Series.unique of 0         0.0
1         1.0
2         2.0
3         3.0
4         4.0
         ...
25415    77.0
25416    78.0
25417    79.0
25418     NaN
25419     NaN
Name: Age_years, Length: 25420, dtype: float64>

In [19]:
data['Age_years']=data['Age_years'].fillna(80)
data.Age_years.unique

<bound method Series.unique of 0         0.0
1         1.0
2         2.0
3         3.0
4         4.0
         ...
25415    77.0
25416    78.0
25417    79.0
25418    80.0
25419    80.0
Name: Age_years, Length: 25420, dtype: float64>

In [20]:
data.dtypes

District        object
Urban/Rural     object
Age_years      float64
Male             int64
Female           int64
Total            int64
County          object
Province        object
OBJECTID         int64
dtype: object

In [22]:
data.tail()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25415,TESO SOUTH,Rural,77.0,99,86,185,Busia,WESTERN,25415
25416,TESO SOUTH,Rural,78.0,63,47,110,Busia,WESTERN,25416
25417,TESO SOUTH,Rural,79.0,90,121,211,Busia,WESTERN,25417
25418,TESO SOUTH,Rural,80.0,384,391,775,Busia,WESTERN,25418
25419,TESO SOUTH,Rural,80.0,25,23,48,Busia,WESTERN,25419

In [23]:
data['Age_years']=data['Age_years'].astype(int)

In [24]:
data.dtypes

District       object
Urban/Rural    object
Age_years       int32
Male            int64
Female          int64
Total           int64
County         object
Province       object
OBJECTID        int64
dtype: object

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [25]:
data.describe()

          Age_years          Male        Female         Total      OBJECTID
count  25420.000000  25420.000000  25420.000000  25420.000000  25420.000000
mean      40.487805    755.014083    763.872502   1518.886585  12709.500000
std       23.649445   1305.988549   1295.903980   2589.418161   7338.266258
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%       20.000000     57.000000     54.000000    112.000000   6354.750000
50%       40.500000    269.500000    281.000000    555.000000  12709.500000
75%       61.000000    891.000000    950.000000   1849.250000  19064.250000
max       80.000000  23060.000000  23090.000000  44473.000000  25419.000000

In [26]:
data.head(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4
5,NAIROBI WEST,Urban,5,7547,7660,15207,Nairobi,NAIROBI,5
6,NAIROBI WEST,Urban,6,6966,7082,14048,Nairobi,NAIROBI,6
7,NAIROBI WEST,Urban,7,6511,6674,13185,Nairobi,NAIROBI,7
8,NAIROBI WEST,Urban,8,6171,6489,12660,Nairobi,NAIROBI,8
9,NAIROBI WEST,Urban,9,6361,6662,13023,Nairobi,NAIROBI,9

In [27]:
# Challenge 1
# What was the average age of a person of Kenya?
data['Age_years'].mean()

40.48780487804878

In [28]:
# Challenge 2
# What was the average female population in Kenya?
data.Female.mean()

763.8725019669552

In [29]:
# Challenge 3
# What was the average male population in Kenya?
data.Male.mean()

755.0140833988985

In [37]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
dense_dist=data.groupby('District')['Total'].sum().head(5)
dense_dist

District
BARINGO          162351
BARINGO NORTH     93789
BOMET            397104
BONDO            157522
BORABU            73426
Name: Total, dtype: int64

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
#

In [ ]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
#

In [ ]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
#

In [ ]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
#

In [ ]:
# Challenge 9
# What was the total population of Busia County?
#

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
#

In [ ]:
# Challenge 11
# What was the Total population of Teso South District?
#

In [ ]:
# Challenge 12
# What was the urban population of Teso South District?
#

In [ ]:
# Challenge 13
# What was the rural population of Teso South District?
#

In [ ]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#

In [ ]:
# Challenge 15
# What was the urban population in Kenya?
#